TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_ble/STM32_WPAN/App/app_sidewalk.c
/**
  ******************************************************************************
  * @file    app_sidewalk.c
  * @brief   Sidewalk-over-BLE app implementation
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

 /* Includes ------------------------------------------------------------------*/

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "app_freertos.h"

#include <sid_api.h>
#include <sid_hal_reset_ifc.h>
#include <sid_log_control.h>
#include <sid_pal_assert_ifc.h>
#include <sid_pal_common_ifc.h>
#include <sid_pal_gpio_ifc.h>
#include <sid_pal_log_ifc.h>

#include SID_APP_VERSION_HEADER
#include <sid_sdk_version.h>

#include "target/memory.h"

#include "app_ble_config.h"
#include "app_common.h"
#include <stm32_mcu_info.h>
#if CFG_LED_SUPPORTED
#  include "led_indication.h"
#endif
#include "sid_pal_gpio_ext_ifc.h"
#if defined(NUCLEO_WBA52_BOARD) || defined(NUCLEO_WBA55_BOARD) || defined(NUCLEO_WBA65_BOARD)
#  include "stm32wbaxx_nucleo.h"
#endif

#if (CFG_LPM_LEVEL != 0)
#  include "stm32_lpm.h"
#endif /* (CFG_LPM_LEVEL != 0) */
#if (CFG_BUTTON_SUPPORTED != 0) && (CFG_LPM_STDBY_SUPPORTED != 0)
#  include <sid_pal_gpio_ext_ifc.h>
#endif /* (CFG_BUTTON_SUPPORTED != 0) && (CFG_LPM_STDBY_SUPPORTED != 0) */

/* Private defines -----------------------------------------------------------*/

#define SID_MSG_QUEUE_LEN            (10u)

#define DEMO_MESSAGE_DELAY_MS        (2u * 60000u) /* Note: setting this to 60 seconds or less prevents the system from entering Standby LPM because a new uplink round starts before BLE link is switched to the slow advertisement mode */

#define BUTTON_LONG_PRESS_MS         (1500u)
#define BUTTON_TIMESTAMP_INVALID_VAL (0u)

/* Private macro -------------------------------------------------------------*/

#define OS_MS_TO_TICKS( xTimeInMs )    ( ( uint32_t ) ( ( ( uint32_t ) ( xTimeInMs ) * ( uint32_t ) osKernelGetTickFreq() ) / ( uint32_t ) 1000U ) )

/* Private typedef -----------------------------------------------------------*/

enum event_type
{
    EVENT_TYPE_START_LINK,
    EVENT_TYPE_STOP_LINK,
    EVENT_TYPE_TOGGLE_LINK,
    EVENT_TYPE_SIDEWALK,
    EVENT_TYPE_SEND_HELLO,
    EVENT_FACTORY_RESET,
    EVENT_TYPE_CONNECTION_REQUEST,
    EVENT_TYPE_REGISTRATION_COMPLETED,
#if (CFG_LPM_STDBY_SUPPORTED != 0)
    EVENT_TYPE_ACTIVE_STANDBY,
    EVENT_TYPE_FULL_STANDBY,
#endif /* CFG_LPM_STDBY_SUPPORTED */
};

enum app_state
{
    STATE_INIT,
    STATE_SIDEWALK_READY,
    STATE_SIDEWALK_NOT_READY,
    STATE_SIDEWALK_SECURE_CONNECTION,
};

struct link_status
{
    uint32_t link_mask;
    uint32_t supported_link_mode[SID_LINK_TYPE_MAX_IDX];
};

typedef struct app_context
{
    osThreadId_t main_task;
    osMessageQueueId_t event_queue;
    struct sid_handle *sidewalk_handle;
    enum app_state state;
    struct link_status link_status;
    uint8_t counter;
    bool connection_request;
} app_context_t;

typedef __PACKED_UNION {
    __PACKED_STRUCT {
        uint8_t build;
        uint8_t patch;
        uint8_t minor;
        uint8_t major;
    };
    uint32_t raw;
} hal_version_info_t;

/* Private variables ---------------------------------------------------------*/

static osMessageQueueId_t g_event_queue;

static osSemaphoreId_t registration_ready_semaphore;
static osSemaphoreId_t connection_ready_semaphore;
static osThreadId_t demo_counter_task;

/* Indicates if Sidewalk registration process is pending */
static bool registration_pending = false;

/* Private constants ---------------------------------------------------------*/

static const osThreadAttr_t sidewalk_stack_task_attributes = {
    .name         = "Sidewalk Stack Task",
    .priority     = SID_MAIN_TASK_PRIO,
    .stack_size   = SID_MAIN_TASK_STACK_SIZE,
    .attr_bits    = TASK_DEFAULT_ATTR_BITS,
    .cb_mem       = TASK_DEFAULT_CB_MEM,
    .cb_size      = TASK_DEFAULT_CB_SIZE,
    .stack_mem    = TASK_DEFAULT_STACK_MEM,
};

static const osSemaphoreAttr_t registration_ready_sem_attributes = {
    .name       = "Sidewalk Registration Semaphore",
    .attr_bits  = TASK_DEFAULT_ATTR_BITS,
    .cb_mem     = TASK_DEFAULT_CB_MEM,
    .cb_size    = TASK_DEFAULT_CB_SIZE,
};

static const osSemaphoreAttr_t connection_ready_sem_attributes = {
    .name       = "Connection Ready Semaphore",
    .attr_bits  = TASK_DEFAULT_ATTR_BITS,
    .cb_mem     = TASK_DEFAULT_CB_MEM,
    .cb_size    = TASK_DEFAULT_CB_SIZE,
};

static const osThreadAttr_t demo_counter_task_attributes = {
    .name         = "Demo Counter Task",
    .priority     = DEMO_COUNTER_TASK_PRIO,
    .stack_size   = DEMO_COUNTER_TASK_STACK_SIZE,
    .attr_bits    = TASK_DEFAULT_ATTR_BITS,
    .cb_mem       = TASK_DEFAULT_CB_MEM,
    .cb_size      = TASK_DEFAULT_CB_SIZE,
    .stack_mem    = TASK_DEFAULT_STACK_MEM,
};

/* Private function prototypes -----------------------------------------------*/

static void queue_event(osMessageQueueId_t queue, enum event_type event);
static void on_sidewalk_event(bool in_isr, void *context);
static void on_sidewalk_msg_received(const struct sid_msg_desc *msg_desc, const struct sid_msg *msg, void *context);
static void on_sidewalk_msg_sent(const struct sid_msg_desc *msg_desc, void *context);
static void on_sidewalk_send_error(sid_error_t error, const struct sid_msg_desc *msg_desc, void *context);
static void on_sidewalk_status_changed(const struct sid_status *status, void *context);
static void on_sidewalk_factory_reset(void *context);
static void send_ping(app_context_t *app_context);
static void factory_reset(app_context_t *context);
static void toggle_connection_request(app_context_t *context);
#if (CFG_BUTTON_SUPPORTED == 1)
static void button1_irq_handler(uint32_t pin, void * callback_arg);
static void button2_irq_handler(uint32_t pin, void * callback_arg);
static void button3_irq_handler(uint32_t pin, void * callback_arg);
#  if (CFG_LPM_STDBY_SUPPORTED != 0)
static void button3_wakeup_handler(uint32_t pin, void * callback_arg);
#  endif /* (CFG_LPM_STDBY_SUPPORTED != 0) */
static void buttons_init(void);
#endif /* (CFG_BUTTON_SUPPORTED == 1) */

static void sidewalk_stack_task_entry(void *context);
static void demo_counter_task_entry(void *context);

/* Private function definitions ----------------------------------------------*/

static void queue_event(osMessageQueueId_t queue, enum event_type event)
{
    (void)osMessageQueuePut(queue, &event, 0u, 0u);
}

