TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_ble/STM32_WPAN/App/app_sidewalk.c
/*----------------------------------------------------------------------------*/

static void sidewalk_stack_task_entry(void *context)
{
    SID_PAL_LOG_INFO("Sidewalk demo started");

    app_context_t *app_context = (app_context_t *)context;
    sid_error_t ret;
    osStatus_t os_status;

    struct sid_event_callbacks event_callbacks = {
        .context           = app_context,
        .on_event          = on_sidewalk_event,          /* Called from ISR context */
        .on_msg_received   = on_sidewalk_msg_received,   /* Called from sid_process() */
        .on_msg_sent       = on_sidewalk_msg_sent,       /* Called from sid_process() */
        .on_send_error     = on_sidewalk_send_error,     /* Called from sid_process() */
        .on_status_changed = on_sidewalk_status_changed, /* Called from sid_process() */
        .on_factory_reset  = on_sidewalk_factory_reset,  /* Called from sid_process */
    };

    struct sid_config config = {
        .link_mask           = SID_LINK_TYPE_1,
        .callbacks           = &event_callbacks,
        .link_config         = app_get_sidewalk_ble_config(),
        .sub_ghz_link_config = NULL,
    };

    /* Performing a cold start of the Sidewalk since device registration status is unknown at this point */
    queue_event(g_event_queue, EVENT_TYPE_START_LINK);

    while (1)
    {
        enum event_type event;

        if (osMessageQueueGet (app_context->event_queue, &event, NULL, osWaitForever) == osOK)
        {
            switch (event)
            {
                case EVENT_TYPE_START_LINK:
                    /* Starting Sidewalk-over-BLE link */
                    if (NULL == app_context->sidewalk_handle)
                    {
                        ret = init_and_start_link(app_context, &config);
                        if (ret != SID_ERROR_NONE)
                        {
                            SID_PAL_LOG_ERROR("Failed to initialize Sidewalk. Error code: %d", (int)ret);
                            goto error;
                        }
                    }
                    else
                    {
                        /* Skip the request, Sidewalk is already running */
                    }
                    break;

                case EVENT_TYPE_TOGGLE_LINK:
                    if(app_context->sidewalk_handle == NULL)
                    {
                        queue_event(g_event_queue, EVENT_TYPE_START_LINK);
                    }
                    else
                    {
                        queue_event(g_event_queue, EVENT_TYPE_STOP_LINK);
                    }
                    break;

                case EVENT_TYPE_STOP_LINK:
                    if (app_context->sidewalk_handle != NULL)
                    {
                        ret = destroy_link(app_context, &config);
                        SID_PAL_ASSERT(ret == SID_ERROR_NONE);
                    }
                    break;

                case EVENT_TYPE_SIDEWALK:
                    if ((NULL == app_context) || (NULL == app_context->sidewalk_handle))
                    {
                        /*  This may happen if Sidewalk link was terminated but the event queue already contained some events - just ignore them */
                        break;
                    }
                    ret = sid_process(app_context->sidewalk_handle);
                    if ((ret != SID_ERROR_NONE) && (ret != SID_ERROR_STOPPED))
                    {
                        SID_PAL_LOG_ERROR("Error processing Sidewalk event, err:%d", (int)ret);
                        goto error;
                    }
                    else if (SID_ERROR_STOPPED == ret)
                    {
                        SID_PAL_LOG_DEBUG("Sidewalk processing discarded - Sidewalk stack is stopped");
                    }
                    else
                    {
                        /* Nothing to do, everything is fine */
                    }
                    break;

                case EVENT_TYPE_SEND_HELLO:
                    send_ping(app_context);
                    break;

                case EVENT_TYPE_REGISTRATION_COMPLETED:
                    /* Indicate to the app that Sidewalk device registration is completed */
                    os_status = osSemaphoreRelease(registration_ready_semaphore);
                    if (os_status != osOK)
                    {
                        SID_PAL_LOG_ERROR("Failed to indicate Sidewalk registration completion. Error code : %d", (int32_t)os_status);
                        goto error;
                    }
                    break;

                case EVENT_FACTORY_RESET:
                    factory_reset(app_context);
                    break;

                case EVENT_TYPE_CONNECTION_REQUEST:
                    toggle_connection_request(app_context);
                    break;

#if (CFG_BUTTON_SUPPORTED != 0) && (CFG_LPM_STDBY_SUPPORTED != 0)
                case EVENT_TYPE_ACTIVE_STANDBY:
                    /**
                     * Note: Sidewalk keeps running in this mode. However, LEDs and buttons will be inactive (except the wakeup source)
                     * due to GPIO being powered down. Periodic wakeups to handle Sidewalk events are indicated by LEDs activation while
                     * the MCU is in Run mode. As soon as Sidewalk radio event is processed, the LEDs are turned off and the system goes
                     * back into Standby LPM.
                     */

                    /* Use B3 button release as a wakeup trigger */
                    ret = sid_pal_gpio_ext_ifc_wakeup_enable(GPIO_PORT_PIN_TO_NUM(B3_GPIO_PORT, B3_PIN), SID_PAL_GPIO_IRQ_TRIGGER_RISING, button3_wakeup_handler, NULL);
                    if (ret != SID_ERROR_NONE)
                    {
                        SID_PAL_LOG_ERROR("Error entering in standby mode: unable to configure wakeup pin, err:%d", (int)ret);
                        goto error;
                    }

                    /* Enable Standby LPM */
                    UTIL_LPM_SetOffMode(1U << CFG_LPM_APP, UTIL_LPM_ENABLE);
                    SID_PAL_LOG_INFO("Standby with retention mode enabled");
                    break;

                case EVENT_TYPE_FULL_STANDBY:
                    /**
                     * Note: Sidewalk connectivity is not available in this mode since neither RAM nor peripheral states are retained.
                     * This mode allows to achieve the lowest power consumption since the only running unit is RTC. System can be woken
                     * up by pressing B3 or scheduling an RTC event. Wakeup startup process is identical to MCU reset flow since all
                     * units have to be initialized from scratch (except RTC).
                     */
                    if ((app_context != NULL) && (app_context->sidewalk_handle != NULL))
                    {
                        ret = destroy_link(app_context, &config);
                        if (ret != SID_ERROR_NONE)
                        {
                            SID_PAL_LOG_ERROR("Error entering in standby mode: unable to terminate Sidewalk link. Error code: %d", (int)ret);
                            goto error;
                        }
                    }

                    /* Use B3 button release as a wakeup trigger */
                    ret = sid_pal_gpio_ext_ifc_wakeup_enable(GPIO_PORT_PIN_TO_NUM(B3_GPIO_PORT, B3_PIN), SID_PAL_GPIO_IRQ_TRIGGER_RISING, button3_wakeup_handler, NULL);
                    if (ret != SID_ERROR_NONE)
                    {
                        SID_PAL_LOG_ERROR("Error entering in standby mode: unable to configure wakeup pin, err:%d", (int)ret);
                        goto error;
                    }

