TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_ble/STM32_WPAN/App/app_sidewalk.c
                    /* Suspend demo task to avoid periodic wakeups from Standby mode */
                    if (demo_counter_task != NULL)
                    {
                        (void)osThreadSuspend(demo_counter_task);
                    }

#  if CFG_LED_SUPPORTED
                    /* Turn off LEDs */
                    led_indication_set(LED_INDICATE_OFF);
#  endif /* CFG_LED_SUPPORTED */

                    /* Disable RAM retention to achieve lowest possible power consumption */
                    HAL_PWREx_DisableSRAM1ContentStandbyRetention();
                    HAL_PWREx_DisableSRAM2ContentStandbyRetention();

                    /* Enable Standby LPM */
                    UTIL_LPM_SetOffMode(1U << CFG_LPM_APP, UTIL_LPM_ENABLE);
                    SID_PAL_LOG_INFO("Entering Standby w/o retention mode...");
                    break;
#endif /* CFG_BUTTON_SUPPORTED && CFG_LPM_STDBY_SUPPORTED */

                default:
                    /* Ignore unknown events */
                    break;
            }
        }
    }

error:
    if (demo_counter_task != NULL)
    {
        (void)osThreadTerminate(demo_counter_task);
        demo_counter_task = NULL;
    }

    if (app_context->sidewalk_handle != NULL)
    {
        sid_stop(app_context->sidewalk_handle, SID_LINK_TYPE_1);
        sid_deinit(app_context->sidewalk_handle);
        app_context->sidewalk_handle = NULL;
    }

#if CFG_LED_SUPPORTED
    (void)led_indication_set(LED_INDICATE_OFF);
#endif /* CFG_LED_SUPPORTED */

    SID_PAL_LOG_INFO("Sidewalk demo terminated due to error");
    Error_Handler();

    osThreadExit(); /* Normally this line is not reachable, but keep it if Error_Handler somehow returns */
}

/*----------------------------------------------------------------------------*/

static void demo_counter_task_entry(void *context)
{
    app_context_t *app_context = (app_context_t *)context;
    osStatus_t status;

    SID_PAL_LOG_INFO("Demo Counter Thread: waiting for the Sidewalk registration to be completed...");
    status = osSemaphoreAcquire(registration_ready_semaphore, osWaitForever);
    if (status != osOK)
    {
        SID_PAL_LOG_ERROR("Demo Counter Thread - failed to wait for Sidewalk device registration to be completed");
        goto error;
    }
    SID_PAL_LOG_INFO("Demo Counter Thread: Sidewalk device is registered, proceeding with the demo...");

    while (1)
    {
        if ((app_context->state != STATE_SIDEWALK_READY) && (app_context->state != STATE_SIDEWALK_SECURE_CONNECTION))
        {
            SID_PAL_LOG_DEBUG("Demo Counter Thread: initiated Sidewalk connection request");
            queue_event(g_event_queue, EVENT_TYPE_CONNECTION_REQUEST);
        }

        status = osSemaphoreAcquire(connection_ready_semaphore, 15000u);
        if (status != osOK)
        {
            if (osErrorTimeout == status)
            {
                SID_PAL_LOG_WARNING("Demo Counter Thread: Sidewalk connection is not available");
            }
            else
            {
                SID_PAL_LOG_ERROR("Demo Counter Thread: unable to establish Sidewalk connection. Error code: %d", status);
            }
            continue;
        }

        while ((STATE_SIDEWALK_READY == app_context->state) || (STATE_SIDEWALK_SECURE_CONNECTION == app_context->state))
        {
            SID_PAL_LOG_DEBUG("Demo Counter Thread: sending out counter update");
            queue_event(g_event_queue, EVENT_TYPE_SEND_HELLO);
            osDelay(DEMO_MESSAGE_DELAY_MS);
        }

        SID_PAL_LOG_DEBUG("Demo Counter Thread: Sidewalk connection lost");
    }

error:
    SID_PAL_LOG_INFO("Demo Counter Thread: Terminated due to error");
    SID_PAL_LOG_FLUSH();
    Error_Handler();

    /* Normally the lines below are not reachable, but keep them if Error_Handler somehow returns */
    demo_counter_task = NULL;
    osThreadExit();
}

/* Global function definitions -----------------------------------------------*/

void SID_APP_Init(void)
{
    /* Adjust Sidewalk log level dynamically - this is needed if the firmware is compiled using
     * Sidewalk SDK static library and the library was assembled with different debug level
     */
    struct sid_log_control_severity sid_log_settings;
    sid_log_control_get_severity(&sid_log_settings);
    if (SID_PAL_LOG_LEVEL != sid_log_settings.level)
    {
        sid_log_settings.level = SID_PAL_LOG_LEVEL;
        sid_log_control_set_severity(&sid_log_settings);
    }

    /* Printout application version info */
    SID_PAL_LOG_INFO("Application name: %s", SID_APP_PROJECT_NAME);
    SID_PAL_LOG_INFO("Application version %s", SID_APP_PROJECT_VERSION_STRING);
    SID_PAL_LOG_INFO("Application build type: %s", SID_APP_PROJECT_BUILD_TYPE);
    SID_PAL_LOG_INFO("Application commit hash: %s", SID_APP_PROJECT_COMMIT_HASH_STRING);
    SID_PAL_LOG_INFO("Application commit description: %s", SID_APP_PROJECT_COMMIT_DESCRIPTION);
    SID_PAL_LOG_INFO("Sidewalk SDK: %u.%u.%u-%u", SID_SDK_MAJOR_VERSION, SID_SDK_MINOR_VERSION, SID_SDK_PATCH_VERSION, SID_SDK_BUILD_VERSION);
    SID_PAL_LOG_INFO("FreeRTOS Kernel: %s", tskKERNEL_VERSION_NUMBER);

    /* CubeMX pack version */
    const hal_version_info_t cubemx_fw_pack_ver = {
        .raw = HAL_GetHalVersion(),
    };
    SID_PAL_LOG_INFO("STM32CubeWBA: %u.%u.%u", cubemx_fw_pack_ver.major, cubemx_fw_pack_ver.minor, cubemx_fw_pack_ver.patch);

    /* Printout MCU details */
    stm32_mcu_info_t mcu_info = stm32_mcu_info_describe_host();
    SID_PAL_LOG_INFO("Host MCU: %s (0x%X), revision: %s (0x%X)", mcu_info.device_name, mcu_info.device_id, mcu_info.rev_name, mcu_info.rev_id);

    platform_parameters_t platform_parameters = {
        .mfg_store_region.addr_start = MANUFACTURE_FLASH_START,
        .mfg_store_region.addr_end   = MANUFACTURE_FLASH_END,
    };

    sid_error_t ret_code = sid_platform_init(&platform_parameters);
    if (ret_code != SID_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Sidewalk Platform Init err: %d", ret_code);
        SID_PAL_ASSERT(0);
    }

#if CFG_LED_SUPPORTED
    ret_code = led_indication_init();
    if (ret_code != SID_ERROR_NONE)
    {
        SID_PAL_LOG_ERROR("Sidewalk Init LED indication err: %d", ret_code);
        SID_PAL_ASSERT(0);
    }
#endif /* CFG_LED_SUPPORTED */

    g_event_queue = osMessageQueueNew(SID_MSG_QUEUE_LEN, sizeof(enum event_type), NULL);
    if (g_event_queue == NULL)
    {
        SID_PAL_LOG_ERROR("Can't create Sidewalk message queue. No memory");
        SID_PAL_ASSERT(0);
    }

    static app_context_t app_context = {
        .event_queue = NULL,
        .main_task = NULL,
        .sidewalk_handle = NULL,
        .state = STATE_INIT,
    };

