TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/stm32wba/sid_ble/STM32_WPAN/App/app_sidewalk.c
#if (CFG_BUTTON_SUPPORTED == 1)
    buttons_init();
#endif /* (CFG_BUTTON_SUPPORTED == 1) */

    app_context.event_queue = g_event_queue;
    app_context.main_task = osThreadNew(sidewalk_stack_task_entry, &app_context, &sidewalk_stack_task_attributes);
    if (NULL == app_context.main_task)
    {
        SID_PAL_LOG_ERROR("Can't create Sidewalk processing thread. No memory");
        SID_PAL_ASSERT(0);
    }

    /* Create a semaphore to monitor Sidewalk registration status */
    registration_ready_semaphore = osSemaphoreNew(1u, 0u, &registration_ready_sem_attributes);
    if (NULL == registration_ready_semaphore)
    {
        SID_PAL_LOG_ERROR("Can't create Sidewalk Registration Status semaphore. No memory");
        SID_PAL_ASSERT(0);
    }

    /* Create a semaphore to monitor Sidewalk connection status */
    connection_ready_semaphore = osSemaphoreNew(1u, 0u, &connection_ready_sem_attributes);
    if (NULL == connection_ready_semaphore)
    {
        SID_PAL_LOG_ERROR("Can't create Sidewalk connection status semaphore. No memory");
        SID_PAL_ASSERT(0);
    }

    demo_counter_task = osThreadNew(demo_counter_task_entry, &app_context, &demo_counter_task_attributes);
    if (NULL == demo_counter_task)
    {
        SID_PAL_LOG_ERROR("Can't create Sidewalk demo thread. No memory");
        SID_PAL_ASSERT(0);
    }
}

/*----------------------------------------------------------------------------*/

void SID_APP_StandbyExit(void)
{
#if (CFG_BUTTON_SUPPORTED == 1)
    /* Restore GPIO and IRQ config for ther buttons */
    buttons_init();
#endif /* CFG_BUTTON_SUPPORTED */
}
